<?php
require("../config.php");
include_once("../db.php");
include_once("../function.php");
$mysqli = getConnection();
?>
<html>

<head>
    <title>Завдання 4</title>
    <link rel="stylesheet" href="Dudii_style.css" type="text/css" />
</head>

<body>
    <div id="div3" class="verh">
        <?php

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Stellata', 'image/magnolia-stellata.jpg', '195.50', '6', 
        // 'Магнолія Stellata - красивоквітучий чагарник або дерево. Найраніший квітучий сорт. Висотою 2-3 м. Дерево листопадне. Одне з найкрасивіших квітучих дерев. Квітки численні, чисто-білого кольору, широко розкриті, складаються з вузьких пелюсток. Квітки мають сильний аромат. Квітки діаметром 8-10 см; частки оцвітини однакові, в числі 12-18, стрічкоподібні, довжиною близько 4-5 см, шириною 1 см, на початку цвітіння горизонтально розпростерті, потім відвертаються назовні. Час цвітіння березень-квітень (в залежності від погодних умов). Чагарник широко розлогий з округлою кроною. Повільноростучий. У віці 20 років близько 3 м заввишки і 3-4 м завширшки. Річний приріст у висоту і ширину 15 см. Листя розташоване черговий, еліптичні або обернено-еліптичні, 6-10 см завдовжки і 5 см завширшки, світло-зелені або зелені, злегка блискучі. Плід - циліндрична збірна листівка довжиною 5-6 см, загострена, скручена внаслідок недорозвинення окремих листівок, зеленувата, на освітленій стороні рожево-червона. Плоди утворюються в вересні.')");

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Nigra', 'image/magnolia-nigra.jpg', '206.99', '10', 
        // 'Магнолія Nigra - Магнолія лілієквіткова Нігра - один з найкрасивіших сортів з найбільш темними квітками серед усіх магнолій. Була завезена в 1861 році J. G. VEITCH з Японії до Англії. Магнолія Nigra повинна рости у вашому саду. Квітки з\'являються одночасно з листям, за формою нагадують вузьку вазу, 10-12 см завдовжки і 5 см завширшки. Забарвлення квітів - зовні рубіново-червоне або пурпурове, всередині біле із світло-сіро-фіолетовими крапками. Час цвітіння - кінець квітня - початок травня, повторне цвітіння - в середині червня, іноді до вересня. Плід - циліндрична збірна листівка довжиною 5-6 см, загострена, скручена внаслідок недорозвинення окремих листівок, зеленувата, на освітленій стороні рожево-червона. Плоди утворюються в вересні. Кущ великий, повільноростучий, висотою і шириною 4 м. Річний приріст: у висоту і ширину 15-20 см. Листки розташовані чергово, оберненояйцевидні, 10-15 см завдовжки, темно-зелені, блискучі, особливо в молодості. Кущ листопадний. Має поверхневі, сильні корені (які є дуже тендітними).')");

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Sunrise', 'image/magnolia-sunrise.jpg', '329.63', '7', 
        // 'Магнолія Sunrise (Magnolia × Soulange\'a \'Sunrise\'). Приголомшуюча магнолія з Китаю! Вона виведена зовсім недавно, в 2009 році. Назва сорту в перекладі звучить як «Схід». І вона дійсно виправдовує свою назву. Кремово-білі квіти з характерними рожево-червоними смугами біля основи кожної пелюстки купаються в променях весняного сонця. Це потрібно побачити! Інші назви цієї рослини: блюдцеподібна магнолія, китайська магнолія. Sunrise – витривалий листопадний широколистяний чагарник. Середнього або повільного зростання. Він виростає у висоту всього до 1,5-3 м, а в ширину - до 1-2 м (після 10 років). Квітки великі, у формі кубка, прості, спрямовані вгору. Вони з\'являються на голих гілках і мають прекрасний аромат. Їх забарвлення вражає - кремово-білі пелюстки з чіткою рожево-фіолетовим трикутником в нижній частині. З трикутника зверху може інколи видно тонку грань,що веде наверх до верхньої частини пелюстки. Квітки дуже довго тримаються на гілках і не пошкоджуються весняними заморозками. Ця магнолія виглядає як незвичайний букет, і її квітки - немов не з цього світу!')");

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Yellow River', 'image/magnolia-yellow_river.jpg', '999.95', '3', 
        // 'Магнолія Yellow River - красиве дерево з приголомшливою кроною. Великі квіти, схожі на лілії, роблять цю рослину надзвичайно привабливою і неповторною. Вони розпускаються ще до появи перших листочків і мають форму келиха. Під час цвітіння відчуваються неймовірні пахощі. Yellow River характеризується помірним зростанням, даючи 25 см приросту в рік. Рослина любить сонце або злегка затінені місця. Віддає перевагу родючим ґрунтам з регулярним зволоженням, але також прекрасно себе почуває і на помірно сухих ґрунтах, що відносяться до типу лужних. Чудово виглядає в групових і поодиноких посадках в поєднанні з хвойними і іншими видами рослин.')");

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Black Tulip', 'image/magnolia-black-tulip.jpg', '999.95', '2', 
        // 'Сорт, отриманий селекціонерами Нової Зеландії, відрізняється найбільш темними і насиченими відтінками лілового кольору. На початку весни, ще до розпускання листя, ажурне дерево суцільно покривається великими темно-ліловими трояндочками квітів, що прекрасно пахнуть. Особливо вишукано дерево виглядає як солітер на тлі смарагдової зелені газону. На ділянці йому потрібно відвести гарно освітлене місце або легку півтінь. При посадці необхідно врахувати потреби дерева - кислий або нейтральний ґрунт, наявність дренажу, регулярне зволоження пристовбурного кола, - тоді воно віддячить хорошим цвітінням. У молодому віці дерево має красиву пірамідальну форму, а з роками його крона розширюється. Протягом усієї вегетації деревце вимагає лише санітарного підрізання, але якщо є необхідність, то його крону можна сформувати на свій розсуд.')");

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Jade Lamp', 'image/magnolia-jade-lamp.jpg', '899', '4', 
        // 'Компактний і сорт повільного зростання Jade Lamp дозволяє милуватися його розвитком протягом багатьох років. Спочатку пагони ростуть вертикально, формуючи привабливу пірамідальну крону. Згодом крона стає густішою, створюючи практично правильну сферу. За бажанням деревце можна формувати, підстригати. Білі квіти, що нагадують великі трояндочки, з\\'являються ще до розпускання листя, і це виглядає заворожуюче. Приємно милуватися їх цвітінням у сонячний весняний день. При посадці саджанця потрібно приготувати об\'ємну ямку, помістивши на її дно дренажний шар не менше 10-15 см, - це вбереже коріння від вимокання. Особливо така процедура рекомендована в регіонах України з регулярними дощами. Ґрунт, що засипається в ямку, повинен мати кислу або нейтральну реакцію. Навесні для утримання вологи пристовбурні кола мульчують або покривають газоном.')");


        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Red Lucky', 'image/magnolia-red-lucky.jpg', '319.45', '14', 
        // 'Білий з рожевим - класична комбінація кольорів. Квітки складаються з білих пелюсток, які зовні вкриті темно-рожевими або рожево-червоними мазками. Всередині квітки білі, прикрашені в центрі темно-фіолетовими з рожевим відливом тичинками. Квітки з\\'являються навесні і знову, повторно, в кінці літа. Вони мають прекрасний аромат. Листки середнього розміру, широкоеліптичної форми, темно-зеленого кольору. Вони досягають у довжину до 8-15 см. З\'являються трохи пізніше після розпускання квіток. Кора гладка, сірого забарвлення. Форма чагарнику - компактна, з хорошою структурою розгалуження і великою кількістю квіток. Висота рослини - 3-4 м (але може досягати і 6 м), а ширина - 1-2 м. Період цвітіння: кінець квітня - середина травня і серпень.')");

        
        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Yellow Bird', 'image/magnolia-yellow-bird.jpg', '329.25', '8', 
        // 'Дуже красиве декоративне дерево з пірамідальною або конічною компактною кроною. Висота середня - від 4 до 10 м. Розцвітає ефектними квітками, які розміщені вертикально і часто на пагонах. Вони прості, запашні, яскраво-жовтого кольору з ніжно-зеленою основою і довжиною 7,5-10 см. Складаються з шести пелюсток спрямованих вгору. Форма квітки - чашоподібна. Квітки дуже довго тримаються на гілках і не пошкоджуються запізнілими весняними заморозками. Час цвітіння травень - червень. Листки широкоеліптичні, великі, світло-зеленого кольору. Даний сорт підходить для всіх типів садів. Але він не стійкий до міського середовища. Він вимагає сонячного місця розташування із захистом від сильних вітрів. Непогано себе почуває і в півтіні. Вимоги до грунту: родючий, вологий добре дренований та багатий гумусом грунт. Кислотність грунту - нейтральна або злегка кисла. Ця магнолія досить морозостійка - може витримувати температуру до -15 ° C. Але в сильні морози потребує укриття. Увага: Магнолії не подобаються пересадки, тому ви відразу повинні вибрати правильне місце для неї в саду!')");

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Leonard Messel', 'image/magnolia-leonard_messel.jpg', '179.96', '10', 
        // 'Магнолія Leonard Messel - гібрид, який отримав визнання Королівського садового товариства. Кущ потужний і досить розгалужений. Показник річного приросту становить 25 см у висоту і 20 см в ширину в рік. У квітні-травні починається цвітіння і розпускання листя. З\'являються великі бутони, що мають форму зірки. Потім розкриваються чашовидні квіти, які мають надзвичайно ефектний вигляд. Рослина любить світло, прекрасно розвивається і росте на кислих гумусних ґрунтах, які необхідно дренувати та досить зволожувати. Сорт Leonard Messel зимостійкий, але потребує укриття, щоб уникнути вимерзання нирок.')");

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Susan', 'image/magnolia-susan.jpg', '229.15', '7', 
        // 'Магнолія Susan - Магнолія гібридна Сюзан - красивоквітучий чагарник або дерево. Пізній гібрид магнолії, отриманий в результаті схрещування магнолії лілієквітної з магнолією зірчастож. Рослина після посадки зацвітає швидко, цвітуть навіть маленькі кущики. Цей гібрид користується великою популярністю. Чагарник щільний, на початку росту конусоподібний, з віком набуває округлу форму. Висота куща 2-3,5 м. Листки темно-зелені, обернено яйцеподібні або овальні, довжиною 6-10 см. Сила росту середня, річний приріст 20 см. Квіти вузько чашкові, дзвоноподібні, діаметром до 15 см, пурпурні, всередині і на кінцях світліше, різко ароматні. Квітки розпускаються раніше або одночасно з листям. Час цвітіння квітень-червень. У квітці всього 6 пелюсткоподібних листочків оцвітини, довгою 10-15 см.')");

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Суланжа', 'image/magnolia-sulanga.jpg', '179.45', '5', 
        // 'Прекрасна, витривала, ароматна рослина. Зростає невеликим, густим, щільним деревцем, від 3 до 5 метрів у висоту. Цю рослину ще називають чашоподібною магнолією, деревом тюльпана, а також магнолією гібридною. Відноситься даний вид до середньо морозостійкого сорту, переносить зниження температури до -20 С °. До зими необхідно нижню частину стовбура утеплювати соломою і хвоєю. Особливо цього потребують молоді дерева. Листя магнолії Суланжа великі, оберненояйцеподібноі форми. Зацвітає рослина ще до появи листя, а може бути і разом з їх розпусканням. Великі квіти в діаметрі 15-20 см всередині білі, зовні їх забарвлення то рожеве, то червоне, то пурпурове або біле з рожевими смугами, дуже ароматні. Дана рослина теплолюбива. Місце для посадки потрібно вибирати сонячне, можна злегка затінене, але обов\'язково захищене від вітру. До грунтів не вимоглива. Але найбільше віддає перевагу кислим грунтам з насиченою органікою. Головне, щоб він був пухким, родючим, гумусовим, рівномірно зволоженим і з хорошим дренажем. Також необхідно проводити підгодівлю магнолії')");

        // mysqli_query($mysqli, "INSERT INTO `Storage` (`id`, `name`, `image`, `price`, `count`, `decription`) 
        // VALUES (NULL, 'Магнолія Goldstar', 'image/magnolia-goldstar.jpg', '799.50', '4', 
        // 'Морозостійкий компактний гібрид має не тільки чудовий колір квітів - ніжно-жовтий, а й привабливий відтінок невеликого овального листя - від темно-зеленого на початку вегетації до бронзово-коричневого в осінній період. Перші квіти розпускаються ще на голих, не вкритих жодним листком, гілках. Деревце має правильну ажурну крону. Воно добре виглядає на тлі смарагдового газону та як солітер на ділянці. Для хорошого розвитку сорт Ґолдстар вимагає кислого або нейтрального складу ґрунту, якісного дренажного шару, який можна внести перед посадкою в посадкову ямку. Потім буде потрібно лише вчасно зволожувати грунт, рихлити пристовбурні кола або висадити в нього газонну траву. По всій території України магнолія зимує без укриття. Щоб гілки крони не обмерзали в холодну пору року, важливо посадити рослину в захищене від вітру місце.')");

        echo "        <div class=\"all\">";
        echo "            <div class=\"row\" id=\"first\">";
        echo "                <div class=\"header\">";
        echo "                    <p>Магнолії</p>";
        echo "                </div>";
        echo "            </div>";
        if ($result = mysqli_query($mysqli, 'SELECT id, name, image FROM `Storage`')) {
            $i = 1;
            while ($row = mysqli_fetch_assoc($result)) {
                if (($i - 1) % 3 == 0) echo "            <div class=\"row\">";
                echo "                <div class=\"element-wrapper\">";
                echo "                    <a href=\"Dudii_product.php?id=" . $row['id'] . "\" target=\"_blank\">";
                echo "                        <div class=\"element\">";
                echo "                            <img src=\"" . $row['image'] . "\">";
                echo "                            <div class=\"hovered\">";
                echo "                                <span class=\"hovered-text\">" . $row['name'] . "</span>";
                echo "                            </div>";
                echo "                        </div>";
                echo "                    </a>";
                echo "                </div>";
                // echo $row['id'] . "  " . $row['name'] . "  " . $row['image'] . "  " . $row['price'] . "  " . $row['count'] . "  " . $row['decription'] . ">";
                if ($i % 3 == 0) echo "            </div>";
                $i++;
            }
            mysqli_free_result($result);
            if ($i % 3 != 0) echo "            </div>";
        } else {
            echo "No results!<br>";
        }
        echo "        </div>";


        mysqli_close($mysqli);
        ?>
    </div>
    <div class="d1">
        <a href="Dudii_lab8.php">Назад</a>
    </div>
</body>

</html>